@post_titles = [
  "Современный минимализм для гостиной",
  "Эко-дизайн: Натуральные материалы в интерьере",
  "Скандинавский стиль: Простота и уют",
  "Идеи для уютного уголка на балконе",
  "Тренды 2024: Модные оттенки в интерьере",
  "Как выбрать идеальный диван для гостиной",
  "Комбинация текстур: Советы по выбору тканей",
  "Декор из натурального дерева",
  "Освещение в интерьере: Как создать атмосферу",
  "Лофт-дизайн: Индустриальный стиль для квартиры",
  "Маленькая кухня: Функциональные решения",
  "Спальня в стиле бохо: Яркие акценты и текстиль",
  "Идеи для домашнего офиса в современном стиле",
  "Как создать гармонию в интерьере с растениями",
  "Топ-5 предметов мебели для маленьких квартир",
  "Идеи зонирования пространства в студии",
  "Декор в пастельных тонах: Уют и спокойствие",
  "Мрамор в интерьере: Элегантность и роскошь",
  "Оформление ванной комнаты в эко-стиле",
  "Как выбрать кресло для рабочего места",
  "Стильная прихожая: Встречаем гостей с комфортом",
  "Небольшая спальня: Оптимальные решения для хранения",
  "Как организовать пространство детской комнаты",
  "Секреты идеального освещения для спальни",
  "Черно-белый интерьер: Классика, проверенная временем",
  "Текстиль в интерьере: Как выбрать шторы и подушки",
  "Создаем уютную гостиную для всей семьи",
  "Японский минимализм: Эстетика простоты",
  "Как оформить интерьер в стиле mid-century",
  "Использование металла в интерьере: Современные тренды"
]

@items = [
  "Диван с мягкой обивкой",
  "Кофейный столик из натурального дерева",
  "Кресло в стиле ретро",
  "Стеллаж для книг из металла",
  "Настенный светильник в индустриальном стиле",
  "Ковер с геометрическим узором",
  "Шторы из льна",
  "Кушетка с яркими подушками",
  "Тумба для обуви",
  "Декоративные подушки с цветочным принтом",
  "Зеркало в рамке из массива",
  "Обеденный стол из стекла",
  "Стул с мягкой спинкой",
  "Торшер с регулируемой высотой",
  "Комод с множеством ящиков",
  "Ванная раковина с оригинальным дизайном",
  "Кухонный остров с барными стульями",
  "Текстиль для ванной: полотенца и коврики",
  "Настенная картина в современном стиле",
  "Декоративные фигурки из керамики",
  "Подвесная люстра в стиле минимализма",
  "Садовая мебель для террасы",
  "Полка для вещей с крючками",
  "Лампа с USB-портом",
  "Мягкий пуф для отдыха",
  "Каминные принадлежности",
  "Подвесной стеллаж для растений",
  "Встраиваемая техника для кухни",
  "Декор для стен: панно и наклейки"
]

@images = [
  "https://i.pinimg.com/564x/df/05/52/df0552bec88aed7f1caf74258e752c33.jpg",
  "https://i.pinimg.com/736x/4f/2b/55/4f2b5564500da68dc257b92f464cf683.jpg",
  "https://i.pinimg.com/736x/a3/13/c1/a313c1992b0066ed0e11ddfa5e645f2c.jpg",
  "https://i.pinimg.com/736x/92/2c/39/922c39f86c776bca63a987d41053b5ce.jpg",
  "https://i.pinimg.com/564x/e1/14/da/e114da44c775e7474eceec57f7924187.jpg",
  "https://i.pinimg.com/564x/a0/ce/71/a0ce7148cbf9a284eea258416122839d.jpg",
  "https://i.pinimg.com/564x/e8/cb/c4/e8cbc4e78b9136261dcd7c02f2169dbf.jpg",
  "https://i.pinimg.com/736x/4c/29/e3/4c29e354b211b40489461905e44b1f15.jpg",
  "https://i.pinimg.com/736x/c5/43/2f/c5432f2e9df72f4d58a5cd4ce18ac1d5.jpg",
  "https://i.pinimg.com/564x/35/2a/a6/352aa67dade28327272fafa66aa5b5f8.jpg",
  "https://i.pinimg.com/564x/c8/ff/60/c8ff60a6c5ec969ef00dfbfcb68ab4e0.jpg",
  "https://i.pinimg.com/736x/49/91/81/49918185608fd74c30e31dd6b329c134.jpg",
  "https://i.pinimg.com/736x/e5/1c/b0/e51cb04e2ebedcb609bf79b02b29c434.jpg",
  "https://i.pinimg.com/564x/7f/ed/e2/7fede24ee8742114fb6027179ed9f388.jpg",
  "https://i.pinimg.com/736x/fe/e5/21/fee521091fc56b14b292a320cd3db842.jpg",
  "https://i.pinimg.com/564x/e3/af/87/e3af8701bae79b212dfa7cd8eb3ba52e.jpg",
  "https://i.pinimg.com/564x/74/8e/88/748e88a5da974c817d4c257b4b516fac.jpg",
  "https://i.pinimg.com/736x/aa/c5/51/aac551747fd4b465d4ff30bd896e7ea9.jpg"
]

@descriptions = [
  "Этот интерьер подчеркивает идею минимализма, где каждый элемент выбран с вниманием к деталям и функциональности.",
  "Натуральные материалы в сочетании с эко-дизайном создают уют и гармонию в пространстве.",
  "Скандинавский стиль предлагает простоту и легкость, делая комнату светлой и просторной.",
  "Небольшие пространства, такие как балкон, могут быть стильными и функциональными с правильными аксессуарами.",
  "В этом интерьере использованы актуальные оттенки 2024 года, которые придают помещению свежий и модный вид.",
  "Правильный выбор дивана может сделать гостиную центром комфорта и отдыха для всей семьи.",
  "Комбинация различных текстур добавляет глубину и индивидуальность любому интерьеру.",
  "Декор из натурального дерева придает интерьеру теплоту и естественность.",
  "Освещение играет ключевую роль в создании атмосферы, добавляя комнате уют или динамичность.",
  "Индустриальный стиль с элементами лофта привносит в интерьер дух урбанистики и современности.",
  "Даже маленькая кухня может быть стильной и функциональной, если грамотно использовать пространство.",
  "Яркие акценты и текстиль создают неповторимую атмосферу в спальне в стиле бохо.",
  "Домашний офис может быть функциональным и стильным, если следовать современным дизайнерским решениям.",
  "Комнатные растения не только украшают интерьер, но и улучшают атмосферу, делая ее более свежей и живой.",
  "Для небольших квартир важно подбирать компактные и многофункциональные предметы мебели.",
  "Зонирование пространства в студии позволяет использовать его максимально эффективно.",
  "Пастельные тона создают в интерьере спокойную и уютную атмосферу.",
  "Мраморные элементы добавляют в интерьер нотки роскоши и элегантности.",
  "Эко-стиль в ванной комнате — это сочетание природы и комфорта, создающее расслабляющую атмосферу.",
  "Выбор правильного кресла для рабочего места — залог комфорта и продуктивности."
]
@prices = (100..1000).step(50).to_a

def seed
  reset_db
  create_users(10)
  create_posts(100)
  create_items(3..10)
end

def reset_db
  Rake::Task['db:drop'].invoke
  Rake::Task['db:create'].invoke
  Rake::Task['db:migrate'].invoke
end

def get_random_bool 
  [true, false].sample
end

def create_users(quantity)
  i = 0

  quantity.times do
    user_data = {
      email: "user_#{i}@email.com",
      password: 'testtest'
    }

    if i == 0
      user_data[:admin] = true
    end

    user = User.create!(user_data)
    puts "User created with id #{user.id}"

    i += 1
  end
end

def create_posts(quantity)
  quantity.times do
    user = User.all.sample
    post = Post.create!(
      title: @post_titles.sample,
      image_url: @images.sample,
      description: @descriptions.sample,
      public: get_random_bool,
      user: user
    )
    puts "Post with title #{post.title} just created"
  end
end

def create_items(quantity)
    Post.all.each do |post|
      quantity.to_a.sample.times do
        user = User.all.sample
        item = post.items.create!(
          name: @items.sample,
          price: @prices.sample, 
          user: post.user
        )
        puts "Item with name #{item.name} for project with title #{item.post.title} just created with price #{item.price}"
      end
    end
    quantity.to_a.sample.times do
      user = User.all.sample
      item = Item.create!(
          name: @items.sample,
          price: @prices.sample, 
          user: user
        )
      puts "Item with name #{item.name} just created with price #{item.price}"
    end
  end

seed